"""
Пусть условие было таким:

Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя.
За один ход игрок может добавить в кучу один камень или увеличить количество камней в куче в два раза. Для того чтобы делать ходы, у каждого игрока есть неограниченное количество камней.
Игра завершается в тот момент, когда количество камней в куче становится не менее 29. Победителем считается игрок, сделавший последний ход, т.е. первым получивший кучу, в которой будет 29 или больше камней.
В начальный момент в куче было S камней, 1 <= S <= 28. Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.

№19.1
Укажите такое значение S, при котором Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом.

№19.2
Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. Укажите минимальное значение S, когда такая ситуация возможна.

В задачах такого типа неудачным считается такой ход Пети, после которого
    1) он проиграет, хотя мог бы выиграть, ИЛИ...
    2) он проиграет быстрее (за меньшее число ходов) чем мог бы, если бы старался затянуть игру.

№20
Найдите два таких значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
    - Петя не может выиграть за один ход;
    - Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания.

№21
Найдите значение S, при котором одновременно выполняются два условия:
    - у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
    - у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
Если найдено несколько значений S, в ответе запишите минимальное из них.
"""

T = 29


def moves(s: int) -> list[int]:
    """Возвращает позиции, доступные из данной."""
    return [s + 1, s * 2]


def R(s: int) -> int:
    """
    Как строится функция ранга позиции:
    1. R(s) = 0, если s >= T
    2.1. Получаем из s множество доступных позиций moves(s) и строим множество их рангов R(moves(s))
    2.2. Выбираем из множества рангов все неположительные значения - множество neg. Возможен один из двух вариантов:
        2.2.1. neg - пустое множество. Тогда R(s) = -max(R(moves(s)))
        2.2.2. neg - непустое множество. Тогда R(s) = -max(neg) + 1
    """
    if s >= T:
        return 0

    r_moves = [R(m) for m in moves(s)]
    neg = [r for r in r_moves if r <= 0]

    if neg:
        return -max(neg) + 1

    return -max(r_moves)


# 19.1
print(*(s for s in range(1, T) if R(s) == -1))

# 19.2
s_19_2 = []
for s in range(1, T):
    r_moves = [R(m) for m in moves(s)]
    if any(r == 1 for r in r_moves) and (R(s) > 0 or not all(r == 1 for r in r_moves)):
        s_19_2.append(s)
print(*s_19_2)

# ну или некрасивый однострочник:
# print(*(s for s in range(1, T) if any(r == 1 for r in [R(m) for m in moves(s)]) and (R(s) > 0 or not all(r == 1 for r in [R(m) for m in moves(s)]))))

# 20
print(*(s for s in range(1, T) if R(s) == 2))

# 21
print(*(s for s in range(1, T) if R(s) == -2))

"""
Примечание 1: для больших чисел и случая двух куч (о чем написано в примечании 3) такое решение за разумное время выполнение не закончит, поэтому нужно кешировнаие. Для этого можно

1. Навесить декоратор на функцию R:

from functools import lru_cache

@lru_cache(None)
def R(s: int) -> int:
    ...

2. Добавить ручное кеширование через словарик:

results = {}

def R(s: int) -> int:
    if s in results:
        return results[s]
    
    if s >= T:
        return 0

    r_moves = [R(m) for m in moves(s)]
    neg = [r for r in r_moves if r <= 0]

    if neg:
        res = -max(neg) + 1
    else:
        res = -max(r_moves)
    
    results[s] = res
    return res
"""

"""
Примечание 2: на ходы могут накладываться какие-то ограничения, поэтому могут быть полезны следующие приемы:

1. Добавить ветвления в функции moves.

Например, умеем всегда делать +2, а также умеем *2, если количество нечетно, и +1, если количество четно. Тогда функция будет иметь:

def moves(s: int) -> list[int]:
    m = [s + 2]
    if s % 2:
        m.append(s * 2)
    else:
        m.append(s + 1)
    return m

2. Рассматривать s не как число, а как пару (текущее число камней в куче, какая-то дополнительная информация о ходе).

Например, нельзя повторять ход противника. Тогда для описанной в начале файла игры в качестве дополнительной информации можно взять число от 0 до 2: 0 - предыдущего хода не было, 1 - предыдущий ход был +1, 2 - предыдущий ход был *2; а функции примут вид:

def moves(s: tuple[int, int]) -> list[tuple[int, int]]:
    m = []
    if s[1] != 1:
        m.append((s[0] + 1, 1))
    if s[1] != 2:
        m.append((s[0] * 2, 2))
    return m

def R(s: tuple[int, int]) -> int:
    if s[0] >= T:
        return 0

    r_moves = [R(m) for m in moves(s)]
    neg = [r for r in r_moves if r <= 0]

    if neg:
        return -max(neg) + 1
    
    return -max(r_moves)

При этом в коде первично функцию R надо вызывать как R((s, 0)).
"""

"""
Примечание 3: разумеется, при добавлении в условие второй кучи ничего принципиально не меняется - нужно только рассматривать s не как число, а как пару чисел. Пусть, к примеру, дано условие (с вопросами из задачи про одну кучу):

Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежат две кучи камней. Игроки ходят по очереди, первый ход делает Петя.
За один ход игрок может:
    - добавить в одну из куч (по своему выбору) 4 камня;
    – увеличить количество камней в одной из куч (по своему выбору) в 2 раза.
Например, пусть в одной куче 20 камней, а в другой 30 камней; такую позицию в игре обозначим (20, 30). Тогда за один ход можно получить любую из четырёх позиций: (24, 30), (20, 34), (40, 30), (20, 60).
Для того чтобы делать ходы, у каждого игрока есть неограниченное количество камней.
Игра завершается в тот момент, когда суммарное количество камней в двух кучах становится не менее 133. Победителем считается игрок, сделавший последний ход, то есть первым получивший такую игровую позицию, при которой в двух кучах суммарно 133 камня или больше.
В начальный момент в первой куче было 17 камней, во второй куче – S камней; 1 <= S <= 115.
Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.

Тогда решение будет иметь вид:

from functools import lru_cache

T = 133
PILE_ONE = 17

def moves(state: tuple[int, int]) -> list[tuple[int, int]]:
    return [(state[0] + 4, state[1]), (state[0] * 2, state[1]), (state[0], state[1] + 4), (state[0], state[1] * 2)]

@lru_cache(None)
def R(state: tuple[int, int]) -> int:
    if state[0] + state[1] >= T:
        return 0

    r_moves = [R(m) for m in moves(state)]
    neg = [r for r in r_moves if r <= 0]

    if neg:
        return -max(neg) + 1

    return -max(r_moves)


# 19.1
print(*(s for s in range(1, T - PILE_ONE) if R((PILE_ONE, s)) == -1))

# 19.2
s_19_2 = []
for s in range(1, T - PILE_ONE):
    r_moves = [R(m) for m in moves((PILE_ONE, s))]
    if any(r == 1 for r in r_moves) and (R((PILE_ONE, s)) > 0 or not all(r == 1 for r in r_moves)):
        s_19_2.append(s)
print(*s_19_2)

# 20
print(*(s for s in range(1, T - PILE_ONE) if R((PILE_ONE, s)) == 2))

# 21
print(*(s for s in range(1, T - PILE_ONE) if R((PILE_ONE, s)) == -2))
"""
